[
  {
    "id": "vedic-astrology",
    "englishName": "Vedic Astrology",
    "sanskritName": "Jyotish",
    "category": "Fundamentals",
    "shortExplanation": "Jyotish, meaning 'science of light,' is the ancient Indian system of astrology based on sidereal zodiac calculations.",
    "fullExplanation": "Vedic astrology, known as Jyotish Shastra, originated in India over 5,000 years ago as part of the Vedic knowledge system. Unlike Western astrology which uses the tropical zodiac (based on seasons), Jyotish uses the sidereal zodiac, aligned with the actual position of stars in the sky.\n\nThis difference, called Ayanamsa, results in about a 23-24 degree shift between the two systems. So if you're a Scorpio in Western astrology, you might be a Libra in Vedic astrology.\n\nVedic astrology incorporates unique elements like the 27 Nakshatras (lunar mansions), the Dasha system for timing predictions, and specific yogas (planetary combinations) that provide remarkably detailed life insights.",
    "howCalculated": "Vedic calculations use the sidereal zodiac, accounting for the precession of equinoxes through the Ayanamsa correction (currently ~24 degrees).",
    "significance": "Jyotish is considered one of the six Vedangas (limbs of the Vedas) and is used for understanding karma, life purpose, and making informed decisions about timing.",
    "relatedTermIds": ["ayanamsa", "sidereal-zodiac", "birth-chart"],
    "parentTermId": null,
    "tags": ["jyotish", "vedic", "hindu astrology", "indian astrology"],
    "iconName": "sparkles",
    "groupInfo": null
  },
  {
    "id": "birth-chart",
    "englishName": "Birth Chart",
    "sanskritName": "Kundli",
    "category": "Fundamentals",
    "shortExplanation": "A Kundli is the celestial snapshot at your birth moment, showing planetary positions across 12 houses and 27 nakshatras.",
    "fullExplanation": "Your Kundli (also called Janam Kundli or horoscope) is a map of the sky at the exact moment and location of your birth. It captures the positions of the Sun, Moon, and planets across the 12 zodiac signs and 12 houses.\n\nThe birth chart serves as your cosmic blueprint, revealing your personality traits, strengths, challenges, and life path. Each planet in a specific sign and house creates unique combinations that shape different areas of your life.\n\nThe most important elements include your Ascendant (Lagna), Moon sign (Rashi), and the positions of all nine Vedic planets. These form the foundation for all astrological analysis.",
    "howCalculated": "Requires exact birth date, time, and location to calculate planetary longitudes and house cusps using astronomical ephemeris data.",
    "significance": "The Kundli is the foundation of all Vedic astrological predictions, compatibility matching, and remedy recommendations.",
    "relatedTermIds": ["vedic-astrology", "house", "planet", "nakshatra"],
    "parentTermId": null,
    "tags": ["horoscope", "janam kundli", "birth horoscope", "natal chart"],
    "iconName": "square.grid.2x2",
    "groupInfo": null
  },
  {
    "id": "ayanamsa",
    "englishName": "Precession Correction",
    "sanskritName": "Ayanamsa",
    "category": "Fundamentals",
    "shortExplanation": "Ayanamsa is the angular difference between tropical and sidereal zodiacs, currently about 24 degrees.",
    "fullExplanation": "Ayanamsa literally means 'the amount of movement' and refers to the gradual shift between the tropical zodiac (used by Western astrology) and the sidereal zodiac (used by Vedic astrology).\n\nThis shift occurs due to the precession of equinoxes - the slow wobble of Earth's axis that takes about 26,000 years to complete one cycle. The result is that the spring equinox point moves backward through the zodiac at roughly 1 degree every 72 years.\n\nDifferent Ayanamsa systems exist (Lahiri, Raman, KP), with Lahiri being most widely used in India. The current Lahiri Ayanamsa is approximately 24 degrees.",
    "howCalculated": "Ayanamsa = Tropical longitude - Sidereal longitude. Various calculation methods exist, with Lahiri (Chitrapaksha) being standard in India.",
    "significance": "Choosing the correct Ayanamsa is crucial for accurate Vedic calculations and explains why your Vedic sign often differs from your Western sign.",
    "relatedTermIds": ["vedic-astrology", "sidereal-zodiac"],
    "parentTermId": null,
    "tags": ["precession", "lahiri", "tropical", "sidereal"],
    "iconName": "arrow.triangle.2.circlepath",
    "groupInfo": null
  },
  {
    "id": "panchang",
    "englishName": "Five Limbs (Daily Almanac)",
    "sanskritName": "Panchang",
    "category": "Panchang",
    "shortExplanation": "Panchang is the Vedic almanac comprising five elements: Tithi, Nakshatra, Yoga, Karana, and Vara (weekday).",
    "fullExplanation": "Panchang, meaning 'five limbs' (pancha + anga), is the traditional Hindu calendar and almanac that tracks five essential time elements. These five elements are:\n\n1. Tithi - Lunar day based on Moon-Sun angle\n2. Nakshatra - Lunar mansion the Moon occupies\n3. Yoga - Sun-Moon angular combination\n4. Karana - Half of a Tithi\n5. Vara - Day of the week\n\nThe Panchang is consulted daily by millions for determining auspicious timings (muhurta) for activities like starting new ventures, travel, ceremonies, and important decisions. It also indicates inauspicious periods like Rahu Kaal to avoid.",
    "howCalculated": "Each element is calculated from the positions of Sun and Moon using precise astronomical formulas from the Hindu lunisolar calendar system.",
    "significance": "The Panchang connects daily life with cosmic rhythms, helping practitioners align their activities with favorable celestial conditions.",
    "relatedTermIds": ["tithi", "nakshatra", "yoga", "karana", "rahu-kaal"],
    "parentTermId": null,
    "tags": ["almanac", "calendar", "daily", "muhurta"],
    "iconName": "calendar",
    "groupInfo": null
  },
  {
    "id": "tithi",
    "englishName": "Lunar Day",
    "sanskritName": "Tithi",
    "category": "Panchang",
    "shortExplanation": "Tithi is a lunar day determined by the 12-degree angular distance between Sun and Moon, totaling 30 tithis per lunar month.",
    "fullExplanation": "Tithi represents one 'lunar day' in the Vedic calendar. Unlike solar days which are roughly equal, tithis vary in length from about 19 to 26 hours because they're based on the Moon's angular separation from the Sun.\n\nA tithi completes when the Moon moves 12 degrees ahead of the Sun. The 30 tithis are divided into two pakshas (fortnights):\n\n- Shukla Paksha (waxing): Pratipada to Purnima (1-15)\n- Krishna Paksha (waning): Pratipada to Amavasya (1-15)\n\nEach tithi has its own deity, characteristics, and suitability for different activities.",
    "howCalculated": "Tithi = (Moon longitude - Sun longitude) / 12. Each 12° difference creates one tithi.",
    "significance": "Tithis determine auspicious days for religious observances, fasting, and ceremonies. Certain tithis like Ekadashi are considered highly spiritual.",
    "relatedTermIds": ["panchang", "paksha.shukla", "paksha.krishna", "purnima", "amavasya"],
    "parentTermId": "panchang",
    "tags": ["lunar day", "moon phase", "calendar"],
    "iconName": "moon.stars.fill",
    "groupInfo": null
  },
  {
    "id": "paksha.shukla",
    "englishName": "Bright Fortnight (Waxing Moon)",
    "sanskritName": "Shukla Paksha",
    "category": "Panchang",
    "shortExplanation": "Shukla Paksha is the bright half of the lunar month when the Moon waxes from new to full.",
    "fullExplanation": "Shukla Paksha (literally 'bright fortnight') is the 15-day period from Amavasya (new moon) to Purnima (full moon) when the Moon's illuminated portion increases nightly.\n\nThis period is generally considered more auspicious for starting new ventures, positive activities, and growth-oriented work. The increasing light symbolizes growth, expansion, and manifestation.\n\nMany important Hindu festivals fall during Shukla Paksha, including Ganesh Chaturthi (Shukla 4), Dussehra (Shukla 10), and most Purnima celebrations.",
    "howCalculated": "Begins the day after Amavasya and continues for 15 tithis until Purnima.",
    "significance": "Shukla Paksha is favored for auspicious beginnings, ceremonies, and activities requiring growth and positive outcomes.",
    "relatedTermIds": ["tithi", "paksha.krishna", "purnima", "amavasya"],
    "parentTermId": "tithi",
    "tags": ["waxing", "bright half", "fortnight"],
    "iconName": "moon.fill",
    "groupInfo": null
  },
  {
    "id": "paksha.krishna",
    "englishName": "Dark Fortnight (Waning Moon)",
    "sanskritName": "Krishna Paksha",
    "category": "Panchang",
    "shortExplanation": "Krishna Paksha is the dark half of the lunar month when the Moon wanes from full to new.",
    "fullExplanation": "Krishna Paksha (literally 'dark fortnight') is the 15-day period from Purnima (full moon) to Amavasya (new moon) when the Moon's visible portion decreases nightly.\n\nWhile sometimes considered less auspicious than Shukla Paksha, this period has its own significance. It's favorable for introspection, spiritual practices, ancestral rituals (Pitru Karma), and activities requiring elimination or completion.\n\nImportant observances during Krishna Paksha include Maha Shivaratri (Krishna 13/14), Krishna Janmashtami (Krishna 8), and Pitru Paksha (the fortnight for ancestor worship).",
    "howCalculated": "Begins the day after Purnima and continues for 15 tithis until Amavasya.",
    "significance": "Krishna Paksha is suited for spiritual practices, releasing what no longer serves, and honoring ancestors.",
    "relatedTermIds": ["tithi", "paksha.shukla", "purnima", "amavasya"],
    "parentTermId": "tithi",
    "tags": ["waning", "dark half", "fortnight"],
    "iconName": "moon",
    "groupInfo": null
  },
  {
    "id": "nakshatra",
    "englishName": "Lunar Mansion",
    "sanskritName": "Nakshatra",
    "category": "Nakshatra",
    "shortExplanation": "Nakshatras are 27 lunar mansions that divide the zodiac into 13°20' segments, each with unique characteristics.",
    "fullExplanation": "The Nakshatra system divides the 360° zodiac into 27 equal parts of 13°20' each. These 'lunar mansions' or 'star clusters' are fundamental to Vedic astrology and predate the 12-sign zodiac system.\n\nEach nakshatra has:\n- A ruling deity that bestows its qualities\n- A planetary lord that influences its nature\n- Four padas (quarters) of 3°20' each\n- Specific characteristics and significations\n\nYour birth nakshatra (determined by Moon's position) is called Janma Nakshatra and is considered even more important than your Moon sign for personality analysis and Dasha calculations.",
    "howCalculated": "Nakshatra position = Sidereal longitude / 13.333. Each nakshatra spans exactly 13°20' of the zodiac.",
    "significance": "Nakshatras provide precise personality insights, determine Dasha timing, and are essential for muhurta (electional astrology) and compatibility matching.",
    "relatedTermIds": ["nakshatra.ashwini", "nakshatra.bharani", "dasha", "matching"],
    "parentTermId": null,
    "tags": ["lunar mansion", "star", "constellation", "moon"],
    "iconName": "star.fill",
    "groupInfo": null
  },
  {
    "id": "nakshatra.ashwini",
    "englishName": "The Horse-Headed Twins",
    "sanskritName": "Ashwini",
    "category": "Nakshatra",
    "shortExplanation": "Ashwini is the first nakshatra, ruled by Ketu, spanning 0°-13°20' Aries, associated with healing, speed, and new beginnings.",
    "fullExplanation": "Ashwini, the first of 27 nakshatras, is symbolized by a horse's head and ruled by the Ashwini Kumaras - the divine twin physicians of the gods. Located at the beginning of Aries (0°-13°20'), it carries the energy of new beginnings and swift action.\n\nPeople born under Ashwini nakshatra are typically quick-minded, independent, and have natural healing abilities. They tend to be pioneers who start things but may struggle with follow-through.\n\nThe ruling planet Ketu gives spiritual depth and intuitive abilities, while the Aries placement provides courage and initiative.",
    "howCalculated": "Moon positioned between 0°00' and 13°20' Aries (sidereal).",
    "significance": "Ashwini natives often excel in medicine, athletics, and fields requiring quick thinking. The nakshatra is auspicious for initiating activities and healing.",
    "relatedTermIds": ["nakshatra", "planet.ketu", "sign.aries"],
    "parentTermId": "nakshatra",
    "tags": ["healing", "speed", "beginnings", "ketu"],
    "iconName": "star.fill",
    "groupInfo": {
      "groupName": "27 Nakshatras",
      "groupTermId": "nakshatra",
      "position": 1,
      "totalInGroup": 27
    }
  },
  {
    "id": "nakshatra.bharani",
    "englishName": "The Bearer",
    "sanskritName": "Bharani",
    "category": "Nakshatra",
    "shortExplanation": "Bharani is the second nakshatra, ruled by Venus, spanning 13°20'-26°40' Aries, associated with transformation and creation.",
    "fullExplanation": "Bharani, meaning 'the bearer,' is symbolized by the yoni (female reproductive organ) and ruled by Yama, the god of death. Despite this seemingly dark association, Bharani represents the creative power of transformation and birth.\n\nLocated in Aries (13°20'-26°40'), this nakshatra combines Venus's creative energy with Mars-ruled Aries' dynamism. People born under Bharani are often intense, creative, and capable of handling extreme situations.\n\nBharani natives may experience significant life transformations and have the ability to bear heavy responsibilities. They're often drawn to creative fields, psychology, or work involving life and death themes.",
    "howCalculated": "Moon positioned between 13°20' and 26°40' Aries (sidereal).",
    "significance": "Bharani represents the womb of creation and transformation. It's associated with forbearance, struggle, and eventual breakthrough.",
    "relatedTermIds": ["nakshatra", "planet.venus", "sign.aries"],
    "parentTermId": "nakshatra",
    "tags": ["transformation", "creation", "venus", "yama"],
    "iconName": "star.fill",
    "groupInfo": {
      "groupName": "27 Nakshatras",
      "groupTermId": "nakshatra",
      "position": 2,
      "totalInGroup": 27
    }
  },
  {
    "id": "nakshatra.rohini",
    "englishName": "The Red One",
    "sanskritName": "Rohini",
    "category": "Nakshatra",
    "shortExplanation": "Rohini is the fourth nakshatra, ruled by Moon, spanning 10°-23°20' Taurus, associated with beauty, growth, and fertility.",
    "fullExplanation": "Rohini, meaning 'the red one' or 'the growing one,' is considered the most beautiful and fertile of all nakshatras. Symbolized by an ox-cart, it represents growth, abundance, and material prosperity.\n\nLocated in Taurus (10°-23°20') and ruled by the Moon, Rohini combines lunar creativity with Venusian earthly pleasures. The presiding deity is Brahma, the creator god, emphasizing its creative potential.\n\nRohini natives are often attractive, artistic, and possess magnetic personalities. Lord Krishna's birth nakshatra was Rohini, adding to its special significance. These individuals excel in arts, agriculture, and businesses related to beauty or luxury.",
    "howCalculated": "Moon positioned between 10°00' and 23°20' Taurus (sidereal).",
    "significance": "Rohini is considered highly auspicious for creativity, relationships, and material growth. Moon is exalted in this nakshatra.",
    "relatedTermIds": ["nakshatra", "planet.moon", "sign.taurus"],
    "parentTermId": "nakshatra",
    "tags": ["beauty", "fertility", "moon", "growth"],
    "iconName": "star.fill",
    "groupInfo": {
      "groupName": "27 Nakshatras",
      "groupTermId": "nakshatra",
      "position": 4,
      "totalInGroup": 27
    }
  },
  {
    "id": "planet.sun",
    "englishName": "Sun",
    "sanskritName": "Surya",
    "category": "Planets",
    "shortExplanation": "Surya represents the soul, ego, authority, and father. It rules Leo and is exalted in Aries.",
    "fullExplanation": "Surya (the Sun) is the king of the planetary cabinet in Vedic astrology, representing Atma (soul), vitality, and consciousness. As the center of our solar system, it symbolizes the core self, authority, leadership, and one's relationship with father figures.\n\nThe Sun rules Leo (Simha) and is exalted in Aries at 10°, debilitated in Libra at 10°. Its friends are Moon, Mars, and Jupiter, while Venus and Saturn are its enemies.\n\nA strong Sun bestows leadership qualities, confidence, good health, and recognition. A weak Sun may indicate ego issues, problems with authority figures, or health problems related to heart, eyes, or bones.",
    "howCalculated": "Sun's position is calculated from astronomical ephemeris, adjusted for sidereal Ayanamsa.",
    "significance": "The Sun represents our essential nature, willpower, and life force. Its house placement shows where we seek recognition and express our authority.",
    "relatedTermIds": ["planet.moon", "sign.leo", "sign.aries"],
    "parentTermId": null,
    "tags": ["surya", "soul", "father", "authority", "leo"],
    "iconName": "sun.max.fill",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 1,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.moon",
    "englishName": "Moon",
    "sanskritName": "Chandra",
    "category": "Planets",
    "shortExplanation": "Chandra represents the mind, emotions, mother, and public image. It rules Cancer and is exalted in Taurus.",
    "fullExplanation": "Chandra (the Moon) is the queen of the planetary cabinet, representing Manas (mind), emotions, and our inner world. As Earth's satellite, it governs our moods, instincts, and receptive nature. It signifies the mother, nurturing, and our emotional needs.\n\nThe Moon rules Cancer (Karka) and is exalted in Taurus at 3°, debilitated in Scorpio at 3°. The Moon's sign (Rashi) is considered as important as the Ascendant in Vedic astrology.\n\nA strong Moon gives emotional stability, good memory, popularity, and nurturing abilities. A weak Moon may cause mental restlessness, mood swings, or issues with mother/maternal figures.",
    "howCalculated": "Moon's position changes rapidly (~12° per day) and determines your Moon sign (Rashi) and birth Nakshatra.",
    "significance": "The Moon sign is central to Vedic astrology, determining your Dasha periods, emotional nature, and compatibility. It's considered even more important than Sun sign.",
    "relatedTermIds": ["planet.sun", "sign.cancer", "nakshatra", "dasha"],
    "parentTermId": null,
    "tags": ["chandra", "mind", "mother", "emotions", "cancer"],
    "iconName": "moon.fill",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 2,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.mars",
    "englishName": "Mars",
    "sanskritName": "Mangal",
    "category": "Planets",
    "shortExplanation": "Mangal represents energy, courage, siblings, and property. It rules Aries and Scorpio, exalted in Capricorn.",
    "fullExplanation": "Mangal (Mars) is the commander of the planetary army, representing physical energy, courage, aggression, and the warrior spirit. It governs younger siblings, property, surgery, and competitive endeavors.\n\nMars rules Aries (Mesha) and Scorpio (Vrishchika), is exalted in Capricorn at 28°, and debilitated in Cancer at 28°. It's a natural malefic but can be very beneficial when well-placed.\n\nA strong Mars gives courage, physical strength, leadership in competitive fields, and property gains. A weak or afflicted Mars may cause anger issues, accidents, conflicts, or the Manglik dosha affecting marriage compatibility.",
    "howCalculated": "Mars takes about 2 years to complete its zodiacal cycle and stays in each sign for approximately 45 days.",
    "significance": "Mars placement indicates how we assert ourselves, handle conflicts, and pursue our goals. The Manglik dosha from Mars' placement affects marriage timing and compatibility.",
    "relatedTermIds": ["planet.sun", "sign.aries", "sign.scorpio", "dosha.manglik"],
    "parentTermId": null,
    "tags": ["mangal", "kuja", "energy", "courage", "siblings"],
    "iconName": "flame.fill",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 3,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.mercury",
    "englishName": "Mercury",
    "sanskritName": "Budha",
    "category": "Planets",
    "shortExplanation": "Budha represents intellect, communication, business, and learning. It rules Gemini and Virgo, exalted in Virgo.",
    "fullExplanation": "Budha (Mercury) is the prince of the planetary cabinet, representing Buddhi (intellect), communication, analysis, and trade. It governs speech, writing, mathematics, and all forms of exchange.\n\nMercury rules Gemini (Mithuna) and Virgo (Kanya), is exalted in Virgo at 15°, and debilitated in Pisces at 15°. As a natural benefic, Mercury adapts to the nature of planets it associates with.\n\nA strong Mercury gives sharp intellect, communication skills, business acumen, and literary abilities. A weak Mercury may cause speech problems, learning difficulties, or issues in business and communication.",
    "howCalculated": "Mercury is never more than 28° from the Sun and has frequent retrograde periods (~3 times yearly).",
    "significance": "Mercury represents our analytical abilities, communication style, and how we process information. It's crucial for education, business, and writing.",
    "relatedTermIds": ["planet.sun", "sign.gemini", "sign.virgo"],
    "parentTermId": null,
    "tags": ["budha", "intellect", "communication", "business"],
    "iconName": "brain.head.profile",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 4,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.jupiter",
    "englishName": "Jupiter",
    "sanskritName": "Guru",
    "category": "Planets",
    "shortExplanation": "Guru represents wisdom, fortune, children, and spirituality. It rules Sagittarius and Pisces, exalted in Cancer.",
    "fullExplanation": "Guru (Jupiter), meaning 'teacher,' is the great benefic of Vedic astrology, representing wisdom, knowledge, dharma (righteousness), and good fortune. It governs children, husband (in female charts), teachers, and spiritual growth.\n\nJupiter rules Sagittarius (Dhanu) and Pisces (Meena), is exalted in Cancer at 5°, and debilitated in Capricorn at 5°. As the largest planet, it expands whatever it touches.\n\nA strong Jupiter bestows wisdom, optimism, wealth, good children, and spiritual inclination. It protects the chart and can mitigate many negative influences. A weak Jupiter may cause lack of faith, poor judgment, or issues with children and teachers.",
    "howCalculated": "Jupiter takes approximately 12 years to complete its zodiacal cycle, spending about one year in each sign.",
    "significance": "Jupiter is considered the most benefic planet, representing our growth potential, faith, and capacity for wisdom. Its transit through signs marks significant life chapters.",
    "relatedTermIds": ["planet.saturn", "sign.sagittarius", "sign.pisces", "yoga.gaja-kesari"],
    "parentTermId": null,
    "tags": ["guru", "brihaspati", "wisdom", "fortune", "teacher"],
    "iconName": "sparkles",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 5,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.venus",
    "englishName": "Venus",
    "sanskritName": "Shukra",
    "category": "Planets",
    "shortExplanation": "Shukra represents love, beauty, luxury, and marriage. It rules Taurus and Libra, exalted in Pisces.",
    "fullExplanation": "Shukra (Venus) is the minister of the planetary cabinet, representing love, beauty, pleasure, luxury, and the arts. It governs marriage (especially for males), romance, comforts, vehicles, and creative expression.\n\nVenus rules Taurus (Vrishabha) and Libra (Tula), is exalted in Pisces at 27°, and debilitated in Virgo at 27°. As a natural benefic, Venus brings grace, charm, and material comforts.\n\nA strong Venus gives artistic talents, beautiful appearance, happy marriage, and material luxuries. A weak Venus may cause relationship problems, lack of refinement, or issues with finances and pleasures.",
    "howCalculated": "Venus is never more than 48° from the Sun and alternates between being a morning star and evening star.",
    "significance": "Venus represents our capacity for love, our aesthetic sense, and what we find pleasurable. It's key for relationship compatibility and creative expression.",
    "relatedTermIds": ["planet.mars", "sign.taurus", "sign.libra", "matching"],
    "parentTermId": null,
    "tags": ["shukra", "love", "beauty", "marriage", "luxury"],
    "iconName": "heart.fill",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 6,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.saturn",
    "englishName": "Saturn",
    "sanskritName": "Shani",
    "category": "Planets",
    "shortExplanation": "Shani represents discipline, karma, delays, and longevity. It rules Capricorn and Aquarius, exalted in Libra.",
    "fullExplanation": "Shani (Saturn) is the servant and judge of the planetary cabinet, representing karma, discipline, hard work, delays, and life lessons. It governs longevity, servants, chronic conditions, and industries like mining and agriculture.\n\nSaturn rules Capricorn (Makara) and Aquarius (Kumbha), is exalted in Libra at 20°, and debilitated in Aries at 20°. Though feared, Saturn rewards hard work and ethical living.\n\nA strong Saturn gives discipline, patience, success through perseverance, and longevity. A weak Saturn may cause delays, obstacles, depression, or chronic health issues. The Sade Sati (7.5 years of Saturn transit) is a significant period of karmic testing.",
    "howCalculated": "Saturn takes approximately 29.5 years to complete its zodiacal cycle, spending about 2.5 years in each sign.",
    "significance": "Saturn teaches life's hard lessons and rewards patient effort. Its transits mark periods of maturation, responsibility, and karmic reckoning.",
    "relatedTermIds": ["planet.jupiter", "sign.capricorn", "sign.aquarius", "sade-sati"],
    "parentTermId": null,
    "tags": ["shani", "karma", "discipline", "delays", "longevity"],
    "iconName": "clock.badge.checkmark",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 7,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.rahu",
    "englishName": "North Node",
    "sanskritName": "Rahu",
    "category": "Planets",
    "shortExplanation": "Rahu represents material desires, obsession, and unconventional paths. It's the Moon's north node, exalted in Taurus/Gemini.",
    "fullExplanation": "Rahu is the north node of the Moon - the point where Moon's orbit crosses the ecliptic going north. In Vedic mythology, Rahu is a shadowy planet (chaya graha) that represents insatiable desires, obsessions, and worldly ambitions.\n\nRahu has no physical body but exerts powerful influence. It's generally considered exalted in Taurus/Gemini and debilitated in Scorpio/Sagittarius. Rahu amplifies the qualities of planets it conjuncts and signs it occupies.\n\nRahu can bring sudden gains, foreign connections, and unconventional success. However, it also causes confusion, deception, and obsessive behaviors. Rahu-Ketu's axis shows karmic themes spanning past and future lives.",
    "howCalculated": "Rahu's position is calculated as the ascending node of Moon's orbit. It moves retrograde, taking ~18 years to complete the zodiac.",
    "significance": "Rahu represents our material obsessions and areas where we seek worldly success. Its Dasha period (18 years) often brings dramatic life changes.",
    "relatedTermIds": ["planet.ketu", "dosha.kaal-sarp", "dasha"],
    "parentTermId": null,
    "tags": ["north node", "obsession", "desires", "foreign"],
    "iconName": "circle.lefthalf.filled",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 8,
      "totalInGroup": 9
    }
  },
  {
    "id": "planet.ketu",
    "englishName": "South Node",
    "sanskritName": "Ketu",
    "category": "Planets",
    "shortExplanation": "Ketu represents spirituality, detachment, and past-life karma. It's the Moon's south node, exalted in Scorpio/Sagittarius.",
    "fullExplanation": "Ketu is the south node of the Moon - the point where Moon's orbit crosses the ecliptic going south. As Rahu's counterpart, Ketu represents spirituality, liberation, past-life skills, and detachment from material concerns.\n\nKetu is generally considered exalted in Scorpio/Sagittarius and debilitated in Taurus/Gemini. It gives sudden insights, spiritual awakening, and abilities that seem to come naturally from past lives.\n\nKetu can bring sudden losses, spiritual experiences, and separation from attachments. While it may cause confusion and lack of direction materially, it excels in spiritual matters, research, and esoteric knowledge.",
    "howCalculated": "Ketu's position is exactly opposite Rahu (180° apart). It also moves retrograde through the zodiac.",
    "significance": "Ketu represents what we've already mastered (past-life skills) and our path to liberation. Its Dasha (7 years) often triggers spiritual growth.",
    "relatedTermIds": ["planet.rahu", "dosha.kaal-sarp", "nakshatra.ashwini"],
    "parentTermId": null,
    "tags": ["south node", "spirituality", "detachment", "past life"],
    "iconName": "circle.righthalf.filled",
    "groupInfo": {
      "groupName": "9 Planets (Navagraha)",
      "groupTermId": "navagraha",
      "position": 9,
      "totalInGroup": 9
    }
  },
  {
    "id": "house",
    "englishName": "House",
    "sanskritName": "Bhava",
    "category": "Houses",
    "shortExplanation": "Bhavas are 12 divisions of the birth chart representing different life areas, from self (1st) to liberation (12th).",
    "fullExplanation": "The 12 Bhavas (houses) divide the birth chart into sectors, each governing specific life areas. Starting from the Ascendant (Lagna), they proceed counterclockwise through the chart.\n\nThe houses are categorized by nature:\n- Kendra (Angular): 1, 4, 7, 10 - Foundation and strength\n- Trikona (Trinal): 1, 5, 9 - Dharma and fortune\n- Dusthana (Difficult): 6, 8, 12 - Challenges and transformation\n- Upachaya (Growth): 3, 6, 10, 11 - Improvement over time\n\nPlanets in houses show where their energy expresses, while the house lord's position shows how that life area is supported or challenged.",
    "howCalculated": "Houses begin at the Ascendant degree and may use equal house (30° each) or unequal house systems depending on tradition.",
    "significance": "House placements show the areas of life where planetary energies manifest. A planet's house position is as important as its sign.",
    "relatedTermIds": ["house.1", "house.7", "house-category.kendra", "house-category.trikona"],
    "parentTermId": null,
    "tags": ["bhava", "life areas", "sectors"],
    "iconName": "square.grid.2x2",
    "groupInfo": null
  },
  {
    "id": "house.1",
    "englishName": "First House (Ascendant)",
    "sanskritName": "Lagna / Tanu Bhava",
    "category": "Houses",
    "shortExplanation": "The 1st house represents self, personality, physical body, and overall life direction. It's the most important house.",
    "fullExplanation": "The First House, called Lagna or Tanu Bhava (House of Body), is the foundation of the entire chart. It represents your physical appearance, constitution, personality, and how you present yourself to the world.\n\nThe Ascendant sign and any planets in the 1st house strongly color your personality and life approach. The Lagna lord's placement is crucial for understanding your overall life direction.\n\nThis is both a Kendra (angular) and Trikona (trinal) house, making it doubly auspicious. Strong 1st house placements give vitality, confidence, and success in life. Weak placements may affect health or self-expression.",
    "howCalculated": "The 1st house begins at the exact degree of the Ascendant (eastern horizon at birth time).",
    "significance": "The Lagna determines the entire house framework and is considered the most important factor in chart analysis. It shows your life's primary themes.",
    "relatedTermIds": ["house", "house.7", "house-category.kendra"],
    "parentTermId": "house",
    "tags": ["ascendant", "lagna", "self", "personality", "body"],
    "iconName": "person.fill",
    "groupInfo": {
      "groupName": "12 Houses (Bhavas)",
      "groupTermId": "house",
      "position": 1,
      "totalInGroup": 12
    }
  },
  {
    "id": "house.7",
    "englishName": "Seventh House (Partnerships)",
    "sanskritName": "Kalatra Bhava",
    "category": "Houses",
    "shortExplanation": "The 7th house represents marriage, partnerships, business relationships, and public interactions.",
    "fullExplanation": "The Seventh House, called Kalatra Bhava (House of Spouse), governs all one-to-one relationships. It primarily signifies marriage, but also business partnerships, contracts, open enemies, and public dealings.\n\nAs the house opposite the Ascendant, it represents 'the other' - those we attract and partner with. The 7th house sign, planets there, and the 7th lord's placement describe your spouse's nature and married life quality.\n\nThis is a Kendra (angular) house, giving it strength. Venus and Jupiter here generally favor marriage, while Saturn may delay it. Multiple planets can indicate multiple marriages or significant relationships.",
    "howCalculated": "The 7th house cusp is exactly opposite the Ascendant (180° away).",
    "significance": "For marriage analysis, the 7th house, its lord, Venus (for males), Jupiter (for females), and the Navamsa chart are all examined together.",
    "relatedTermIds": ["house", "house.1", "matching", "planet.venus"],
    "parentTermId": "house",
    "tags": ["marriage", "spouse", "partnerships", "business"],
    "iconName": "person.2.fill",
    "groupInfo": {
      "groupName": "12 Houses (Bhavas)",
      "groupTermId": "house",
      "position": 7,
      "totalInGroup": 12
    }
  },
  {
    "id": "house.10",
    "englishName": "Tenth House (Career)",
    "sanskritName": "Karma Bhava",
    "category": "Houses",
    "shortExplanation": "The 10th house represents career, profession, public reputation, and achievements. It shows your place in society.",
    "fullExplanation": "The Tenth House, called Karma Bhava (House of Action), governs your career, profession, public status, and life achievements. It represents your contribution to society and how the world sees you professionally.\n\nThis is the highest point of the chart (Midheaven in Western astrology) and the most visible house. Planets here are strong and prominently expressed in your public life.\n\nAs a Kendra (angular) and Upachaya (growth) house, the 10th gets stronger with age. Career success often builds over time. The 10th lord's placement shows how you achieve professional success.",
    "howCalculated": "The 10th house represents the highest point of the ecliptic at birth time (meridian/midheaven).",
    "significance": "Career analysis involves the 10th house, its lord, planets aspecting it, and the Dashamsha (D10) divisional chart for detailed professional insights.",
    "relatedTermIds": ["house", "house.1", "house.4", "house-category.kendra"],
    "parentTermId": "house",
    "tags": ["career", "profession", "status", "fame", "achievement"],
    "iconName": "briefcase.fill",
    "groupInfo": {
      "groupName": "12 Houses (Bhavas)",
      "groupTermId": "house",
      "position": 10,
      "totalInGroup": 12
    }
  },
  {
    "id": "house-category.kendra",
    "englishName": "Angular Houses",
    "sanskritName": "Kendra",
    "category": "Houses",
    "shortExplanation": "Kendras are the four angular houses (1, 4, 7, 10) that form the chart's foundation and provide stability and strength.",
    "fullExplanation": "Kendra houses (1st, 4th, 7th, 10th) are the four 'pillars' of the birth chart, corresponding to the four cardinal directions. The word Kendra means 'center' and these houses provide the fundamental structure for life.\n\nEach Kendra governs core life areas:\n- 1st (East): Self and body\n- 4th (North): Home and mother\n- 7th (West): Marriage and partnerships\n- 10th (South): Career and public life\n\nPlanets in Kendras are considered strong and well-positioned. Benefics here give excellent results, while malefics are tempered and can become productive. The strength of Kendras determines overall chart stability.",
    "howCalculated": "Houses 1, 4, 7, and 10 are always Kendras regardless of the Ascendant sign.",
    "significance": "Strong Kendras give stability, success, and good health. Weak Kendras may cause instability in the corresponding life areas.",
    "relatedTermIds": ["house", "house.1", "house.4", "house.7", "house.10", "house-category.trikona"],
    "parentTermId": "house",
    "tags": ["angular", "pillars", "strength", "stability"],
    "iconName": "square.grid.2x2.fill",
    "groupInfo": null
  },
  {
    "id": "house-category.trikona",
    "englishName": "Trine Houses",
    "sanskritName": "Trikona",
    "category": "Houses",
    "shortExplanation": "Trikonas are the three trine houses (1, 5, 9) representing dharma, fortune, and spiritual merit.",
    "fullExplanation": "Trikona houses (1st, 5th, 9th) form a triangular relationship in the chart, representing the principle of Dharma (righteous life path). These are considered the most auspicious houses after Kendras.\n\nEach Trikona governs aspects of fortune:\n- 1st: Self and inherent merit\n- 5th: Children, creativity, past-life merit (Purva Punya)\n- 9th: Fortune, higher learning, father, guru\n\nPlanets in Trikonas give fortunate results. The 5th and 9th houses especially bring unexpected blessings, spiritual growth, and protection. Lords of Trikonas becoming Yoga-karakas (combined benefic rulers) create powerful Raj Yogas.",
    "howCalculated": "Houses 1, 5, and 9 form the Trikona triangle (120° apart from each other).",
    "significance": "Trikona strength indicates dharmic merit, fortune, and divine grace. Strong Trikonas protect against many difficulties.",
    "relatedTermIds": ["house", "house.1", "house.5", "house.9", "house-category.kendra"],
    "parentTermId": "house",
    "tags": ["trine", "dharma", "fortune", "merit"],
    "iconName": "triangle.fill",
    "groupInfo": null
  },
  {
    "id": "house-category.dusthana",
    "englishName": "Difficult Houses",
    "sanskritName": "Dusthana",
    "category": "Houses",
    "shortExplanation": "Dusthanas are challenging houses (6, 8, 12) associated with obstacles, transformation, and losses.",
    "fullExplanation": "Dusthana houses (6th, 8th, 12th) represent life's challenging areas. The word means 'bad place' but these houses serve important karmic purposes.\n\nEach Dusthana has specific themes:\n- 6th: Enemies, diseases, debts, service\n- 8th: Death, transformation, occult, inheritance\n- 12th: Loss, expenses, foreign lands, liberation\n\nWhile challenging, Dusthanas aren't entirely negative. The 6th builds resilience through overcoming obstacles. The 8th brings transformation and hidden knowledge. The 12th enables spiritual liberation and foreign opportunities.\n\nMalefics often perform well in Dusthanas (Vipareet Raj Yoga), turning challenges into strengths.",
    "howCalculated": "Houses 6, 8, and 12 are always Dusthanas regardless of the Ascendant sign.",
    "significance": "Dusthana themes require careful navigation. Their lords' placements and aspects significantly affect the extent of challenges or benefits.",
    "relatedTermIds": ["house", "house.6", "house.8", "house.12"],
    "parentTermId": "house",
    "tags": ["difficult", "challenges", "obstacles", "transformation"],
    "iconName": "exclamationmark.triangle.fill",
    "groupInfo": null
  },
  {
    "id": "vimshottari-dasha",
    "englishName": "120-Year Planetary Period System",
    "sanskritName": "Vimshottari Dasha",
    "category": "Dasha",
    "shortExplanation": "Vimshottari is the most used Dasha system, dividing 120 years among 9 planets based on your birth nakshatra.",
    "fullExplanation": "Vimshottari Dasha is Vedic astrology's primary timing system, uniquely capable of predicting when specific karmas will manifest. The name means '120' - the total years of the complete cycle.\n\nThe planet ruling your birth nakshatra determines which Dasha you're born into. The sequence is:\nKetu (7), Venus (20), Sun (6), Moon (10), Mars (7), Rahu (18), Jupiter (16), Saturn (19), Mercury (17)\n\nEach main period (Mahadasha) subdivides into sub-periods (Antardasha, Pratyantardasha) following the same sequence. This creates precise timing for predictions.\n\nThe running Dasha planet's strength, placement, and aspects determine the quality of that life period.",
    "howCalculated": "Starting Dasha is determined by Moon's nakshatra position. The balance at birth is calculated from Moon's exact degree within that nakshatra.",
    "significance": "Dasha periods explain why similar charts have different life timings. They're essential for predicting when planetary promises will manifest.",
    "relatedTermIds": ["mahadasha", "antardasha", "nakshatra", "planet.moon"],
    "parentTermId": null,
    "tags": ["timing", "prediction", "periods", "planetary cycles"],
    "iconName": "clock.fill",
    "groupInfo": null
  },
  {
    "id": "mahadasha",
    "englishName": "Major Period",
    "sanskritName": "Mahadasha",
    "category": "Dasha",
    "shortExplanation": "Mahadasha is the major planetary period lasting 6-20 years, setting the primary theme of that life phase.",
    "fullExplanation": "Mahadasha (great period) is the primary level of the Vimshottari Dasha system. Each planet rules a Mahadasha of fixed length:\n\n- Sun: 6 years\n- Moon: 10 years\n- Mars: 7 years\n- Rahu: 18 years\n- Jupiter: 16 years\n- Saturn: 19 years\n- Mercury: 17 years\n- Ketu: 7 years\n- Venus: 20 years\n\nThe Mahadasha planet becomes like a temporary Lagna lord, coloring all experiences. Its natal position (house, sign, aspects) determines whether the period brings growth or challenges.\n\nMahadasha changes mark significant life transitions. Preparation and remedies are often recommended before difficult Mahadashas begin.",
    "howCalculated": "Mahadasha length is fixed for each planet. Your current Mahadasha depends on time elapsed since birth in the Dasha sequence.",
    "significance": "Understanding your current Mahadasha reveals the primary cosmic influence on your life and helps plan accordingly.",
    "relatedTermIds": ["vimshottari-dasha", "antardasha", "pratyantardasha"],
    "parentTermId": "vimshottari-dasha",
    "tags": ["major period", "main dasha", "timing"],
    "iconName": "clock.fill",
    "groupInfo": null
  },
  {
    "id": "antardasha",
    "englishName": "Sub-Period",
    "sanskritName": "Antardasha",
    "category": "Dasha",
    "shortExplanation": "Antardasha is the sub-period within a Mahadasha, modifying the main theme with another planetary influence.",
    "fullExplanation": "Antardasha (sub-period) divides each Mahadasha into nine parts, one for each planet. The Antardasha planet adds its flavor to the Mahadasha theme.\n\nAntardasha lengths are proportional to Mahadasha lengths. For example, in Venus Mahadasha (20 years):\n- Venus-Venus: 3y 4m\n- Venus-Sun: 1y\n- Venus-Moon: 1y 8m\n- And so on...\n\nThe relationship between Mahadasha and Antardasha lords significantly affects the period's quality. Friendly planets or yoga-forming combinations give better results than inimical ones.\n\nPredictions become more precise when considering both Mahadasha and Antardasha together.",
    "howCalculated": "Antardasha length = (Mahadasha length × Antardasha planet's years) / 120. Sequence follows Mahadasha planet first.",
    "significance": "Antardasha timing allows more precise predictions than Mahadasha alone. Events often manifest when Antardasha supports the Mahadasha promise.",
    "relatedTermIds": ["vimshottari-dasha", "mahadasha", "pratyantardasha"],
    "parentTermId": "vimshottari-dasha",
    "tags": ["sub-period", "bhukti", "timing"],
    "iconName": "clock.badge",
    "groupInfo": null
  },
  {
    "id": "pratyantardasha",
    "englishName": "Sub-Sub-Period",
    "sanskritName": "Pratyantardasha",
    "category": "Dasha",
    "shortExplanation": "Pratyantardasha is the third level of Dasha timing, further refining predictions to weeks or months.",
    "fullExplanation": "Pratyantardasha divides each Antardasha into nine further parts, creating the third level of timing precision. This allows predictions accurate to weeks or even days when combined with transits.\n\nAt this level, three planets' influences combine:\n1. Mahadasha lord - Overall theme\n2. Antardasha lord - Sub-theme\n3. Pratyantardasha lord - Immediate trigger\n\nPratyantardasha periods can be as short as a few days (Ketu Pratyantardasha in a short Antardasha) or several months. Significant events often occur when all three Dasha levels support a natal promise.\n\nFurther sub-divisions (Sookshma, Prana) exist but are rarely used in practice.",
    "howCalculated": "Pratyantardasha length = (Antardasha length × Pratyantardasha planet's years) / 120.",
    "significance": "Pratyantardasha provides event-level timing precision. Combined with transits, it pinpoints when specific events may occur.",
    "relatedTermIds": ["vimshottari-dasha", "mahadasha", "antardasha"],
    "parentTermId": "vimshottari-dasha",
    "tags": ["sub-sub-period", "pratyantar", "precise timing"],
    "iconName": "clock.badge.checkmark",
    "groupInfo": null
  },
  {
    "id": "ashtakoot",
    "englishName": "Eight-Fold Compatibility",
    "sanskritName": "Ashtakoot Milan",
    "category": "Matching",
    "shortExplanation": "Ashtakoot is the traditional 8-factor compatibility system scoring 36 points (Gunas) for marriage matching.",
    "fullExplanation": "Ashtakoot Milan is Vedic astrology's most popular compatibility assessment, comparing the Moon positions of prospective partners across eight factors (Koots).\n\nThe eight factors and maximum points:\n1. Varna (1): Spiritual compatibility\n2. Vashya (2): Mutual attraction/control\n3. Tara (3): Birth star compatibility\n4. Yoni (4): Sexual compatibility\n5. Graha Maitri (5): Planetary friendship\n6. Gana (6): Temperament match\n7. Bhakoot (7): Emotional compatibility\n8. Nadi (8): Health/genetics\n\nTotal possible score is 36 Gunas. Generally, 18+ is considered acceptable, 24+ is good, and 32+ is excellent. However, Nadi dosha (0 points) is considered serious regardless of total score.",
    "howCalculated": "Each factor is calculated from the Moon signs and nakshatras of both individuals using traditional lookup tables.",
    "significance": "Ashtakoot provides a quick compatibility snapshot, but complete matching also requires comparing full charts (Kundli matching).",
    "relatedTermIds": ["matching", "ashtakoot.varna", "ashtakoot.nadi", "nakshatra"],
    "parentTermId": null,
    "tags": ["gun milan", "compatibility", "marriage", "matching"],
    "iconName": "heart.fill",
    "groupInfo": null
  },
  {
    "id": "ashtakoot.varna",
    "englishName": "Spiritual Compatibility",
    "sanskritName": "Varna",
    "category": "Matching",
    "shortExplanation": "Varna measures spiritual/ego compatibility based on sign categories. Maximum 1 point of 36.",
    "fullExplanation": "Varna (caste/class) assesses spiritual and ego compatibility through the four-fold classification of zodiac signs:\n\n- Brahmin (Spiritual): Cancer, Scorpio, Pisces\n- Kshatriya (Warrior): Aries, Leo, Sagittarius\n- Vaishya (Merchant): Taurus, Virgo, Capricorn\n- Shudra (Worker): Gemini, Libra, Aquarius\n\nScoring:\n- Same Varna or groom higher: 1 point\n- Bride's Varna higher: 0 points\n\nThough worth only 1 point, Varna indicates whether the couple's spiritual outlooks and ego structures are compatible. A mismatch doesn't doom the relationship but may cause friction in life philosophy.",
    "howCalculated": "Based on Moon sign of each partner. Classification follows the element/quality combination of signs.",
    "significance": "Varna reflects spiritual and social compatibility. While low in points, it indicates whether partners view life through similar lenses.",
    "relatedTermIds": ["ashtakoot", "ashtakoot.vashya", "matching"],
    "parentTermId": "ashtakoot",
    "tags": ["spiritual", "ego", "compatibility"],
    "iconName": "sparkles",
    "groupInfo": {
      "groupName": "8 Koots (Ashtakoot)",
      "groupTermId": "ashtakoot",
      "position": 1,
      "totalInGroup": 8
    }
  },
  {
    "id": "ashtakoot.nadi",
    "englishName": "Health & Genetics",
    "sanskritName": "Nadi",
    "category": "Matching",
    "shortExplanation": "Nadi assesses health and genetic compatibility through nakshatra types. Maximum 8 points, most important factor.",
    "fullExplanation": "Nadi (pulse/nerve) is the most important Koot, assessing physiological and genetic compatibility. The 27 nakshatras are classified into three Nadis:\n\n- Aadi (Beginning): Ashwini, Ardra, Punarvasu, etc.\n- Madhya (Middle): Bharani, Mrigashira, Pushya, etc.\n- Antya (End): Krittika, Rohini, Ashlesha, etc.\n\nScoring:\n- Different Nadis: 8 points (full)\n- Same Nadi: 0 points (Nadi Dosha)\n\nNadi Dosha is considered serious as same-Nadi couples may face health issues or problems with progeny according to traditional belief. However, many exceptions and cancellations exist.\n\nNadi Dosha cancellations include: different Rashi, different Nakshatra with same Rashi, and specific Nakshatra combinations.",
    "howCalculated": "Based on birth nakshatra classification. Each nakshatra belongs to one of three Nadi groups.",
    "significance": "Nadi carries the highest weight (8 points) and Nadi Dosha is taken seriously in traditional matching. Modern practitioners may weigh other factors equally.",
    "relatedTermIds": ["ashtakoot", "nakshatra", "matching"],
    "parentTermId": "ashtakoot",
    "tags": ["health", "genetics", "progeny", "nadi dosha"],
    "iconName": "heart.text.square",
    "groupInfo": {
      "groupName": "8 Koots (Ashtakoot)",
      "groupTermId": "ashtakoot",
      "position": 8,
      "totalInGroup": 8
    }
  },
  {
    "id": "dosha.manglik",
    "englishName": "Mars Affliction",
    "sanskritName": "Manglik Dosha",
    "category": "Doshas",
    "shortExplanation": "Manglik Dosha occurs when Mars is in houses 1, 2, 4, 7, 8, or 12, potentially affecting marriage.",
    "fullExplanation": "Manglik Dosha (also Kuja Dosha or Mangal Dosha) is formed when Mars occupies the 1st, 2nd, 4th, 7th, 8th, or 12th house from Lagna, Moon, or Venus. It's one of the most discussed doshas in Indian matrimonial contexts.\n\nTraditional belief holds that Manglik individuals may face marriage delays, conflicts, or spouse health issues. The dosha is considered strongest from the 7th and 8th houses.\n\nMany cancellations (Dosha Bhanga) exist:\n- Mars in own sign or exalted\n- Mars aspected by benefics\n- Both partners being Manglik\n- Mars in specific nakshatras\n- Certain sign placements\n\nModern astrologers vary in how seriously they consider this dosha. Many successful marriages exist with one Manglik partner.",
    "howCalculated": "Check Mars position from Lagna, Moon sign, and Venus in the birth chart. Presence in specified houses indicates the dosha.",
    "significance": "Manglik Dosha is widely checked in Indian matrimonial matching. Understanding cancellations prevents unnecessary concern.",
    "relatedTermIds": ["planet.mars", "house.7", "house.8", "matching"],
    "parentTermId": null,
    "tags": ["kuja dosha", "mars", "marriage", "compatibility"],
    "iconName": "exclamationmark.triangle.fill",
    "groupInfo": null
  },
  {
    "id": "rahu-kaal",
    "englishName": "Rahu's Period",
    "sanskritName": "Rahu Kaal",
    "category": "Panchang",
    "shortExplanation": "Rahu Kaal is a daily inauspicious period of about 90 minutes ruled by Rahu, when new ventures should be avoided.",
    "fullExplanation": "Rahu Kaal is a daily period considered inauspicious for starting new activities. It's calculated by dividing the daylight hours into 8 parts, with one part assigned to each day's Rahu Kaal.\n\nThe Rahu Kaal timing varies by weekday:\n- Sunday: 4:30 PM - 6:00 PM (8th part)\n- Monday: 7:30 AM - 9:00 AM (2nd part)\n- Tuesday: 3:00 PM - 4:30 PM (7th part)\n- Wednesday: 12:00 PM - 1:30 PM (5th part)\n- Thursday: 1:30 PM - 3:00 PM (6th part)\n- Friday: 10:30 AM - 12:00 PM (4th part)\n- Saturday: 9:00 AM - 10:30 AM (3rd part)\n\n(Times are approximate for 6 AM sunrise; actual times vary by location and season.)\n\nActivities already in progress can continue. Only starting new important activities is discouraged.",
    "howCalculated": "Daylight duration (sunrise to sunset) / 8. The specific segment varies by weekday following a fixed pattern.",
    "significance": "Rahu Kaal is widely observed in South India especially. Many avoid signing contracts, starting journeys, or important meetings during this period.",
    "relatedTermIds": ["panchang", "planet.rahu", "yamaganda", "gulika"],
    "parentTermId": "panchang",
    "tags": ["inauspicious", "timing", "muhurta", "rahu"],
    "iconName": "exclamationmark.triangle",
    "groupInfo": null
  },
  {
    "id": "yoga.gaja-kesari",
    "englishName": "Elephant-Lion Combination",
    "sanskritName": "Gaja Kesari Yoga",
    "category": "Yogas",
    "shortExplanation": "Gaja Kesari Yoga is formed when Jupiter is in a Kendra from Moon, giving wisdom, fame, and prosperity.",
    "fullExplanation": "Gaja Kesari Yoga, meaning 'Elephant-Lion combination,' is one of the most celebrated yogas in Vedic astrology. It forms when Jupiter is in the 1st, 4th, 7th, or 10th house from the Moon.\n\nThis yoga combines Jupiter's wisdom with the Moon's public appeal, creating individuals who are:\n- Highly intelligent and learned\n- Respected in society\n- Prosperous and fortunate\n- Good speakers and advisors\n- Blessed with lasting fame\n\nThe yoga's strength depends on:\n- Jupiter's dignity (sign placement)\n- Absence of malefic aspects\n- Overall chart strength\n- The specific Kendra position\n\nJupiter in the 4th from Moon is often considered the strongest placement for this yoga.",
    "howCalculated": "Check if Jupiter is in houses 1, 4, 7, or 10 from Moon's position in the birth chart.",
    "significance": "Gaja Kesari Yoga is common (about 25% of charts) but its strength varies greatly. When strong, it gives significant life blessings.",
    "relatedTermIds": ["planet.jupiter", "planet.moon", "house-category.kendra", "yoga"],
    "parentTermId": null,
    "tags": ["jupiter", "moon", "fame", "wisdom", "prosperity"],
    "iconName": "star.circle.fill",
    "groupInfo": null
  },
  {
    "id": "sign.aries",
    "englishName": "The Ram",
    "sanskritName": "Mesha",
    "category": "Signs",
    "shortExplanation": "Mesha (Aries) is the first sign, ruled by Mars, representing initiative, courage, and pioneering spirit.",
    "fullExplanation": "Mesha (Aries) is the first sign of the zodiac, spanning 0°-30° of the sidereal zodiac. Ruled by Mars and symbolized by the Ram, it embodies the principle of new beginnings and initiative.\n\nAries Characteristics:\n- Element: Fire (Agni Tattva)\n- Quality: Cardinal/Movable (Chara)\n- Direction: East\n- Body part: Head\n- Exaltation: Sun at 10°\n- Debilitation: Saturn at 20°\n\nAries energy is direct, competitive, and action-oriented. Those with strong Aries placements are natural pioneers who prefer leading to following. They can be impatient and may start more than they finish.\n\nThe three nakshatras in Aries are Ashwini, Bharani, and part of Krittika, each adding distinct qualities.",
    "howCalculated": "Planets between 0° and 30° of sidereal longitude are in Aries/Mesha.",
    "significance": "Aries represents where we initiate action and assert ourselves. Its placement shows areas of courage and potential impulsiveness.",
    "relatedTermIds": ["planet.mars", "nakshatra.ashwini", "nakshatra.bharani", "sign.scorpio"],
    "parentTermId": null,
    "tags": ["fire", "cardinal", "mars", "initiative"],
    "iconName": "flame",
    "groupInfo": {
      "groupName": "12 Signs (Rashis)",
      "groupTermId": "sign",
      "position": 1,
      "totalInGroup": 12
    }
  },
  {
    "id": "yoga",
    "englishName": "Planetary Combination",
    "sanskritName": "Yoga",
    "category": "Yogas",
    "shortExplanation": "A Yoga is a specific planetary combination that produces particular results - beneficial (Shubha) or challenging (Ashubha).",
    "fullExplanation": "In Vedic astrology, Yoga means 'union' or 'combination' - specific planetary configurations that produce identifiable results. There are thousands of yogas described in classical texts.\n\nYogas fall into several categories:\n- Raj Yogas: Combinations for power and success\n- Dhana Yogas: Wealth-producing combinations\n- Pancha Mahapurusha: Five great person yogas (planets in own/exalted signs in Kendras)\n- Nabhasa Yogas: Based on planetary patterns\n- Chandika Yogas: Moon-based combinations\n- Dosha Yogas: Challenging combinations\n\nA yoga's strength depends on:\n- The planets' dignity and strength\n- House lordships of involved planets\n- Aspects from other planets\n- Dasha timing for manifestation\n\nNot all yogas manifest equally - chart context and timing matter greatly.",
    "howCalculated": "Each yoga has specific formation rules involving planetary positions, sign placements, and house lordships.",
    "significance": "Yogas provide quick chart assessment. However, the overall chart context and Dasha timing determine when and how strongly they manifest.",
    "relatedTermIds": ["yoga.gaja-kesari", "yoga.raj", "dosha", "dasha"],
    "parentTermId": null,
    "tags": ["combination", "planetary union", "pattern"],
    "iconName": "link",
    "groupInfo": null
  }
]
